# CanSplitStraight Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..CanSplitStraight Method
FabricationPart Class See Also
---
Validates if the straight can be split into two at the passed in point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool CanSplitStraight(
	XYZ position
)
```

Visual Basic
---
```text
Public Function CanSplitStraight ( _
	position As XYZ _
) As Boolean
```

Visual C++
---
```text
public:
bool CanSplitStraight(
	XYZ^ position
)
```

# ### Parameters
position
    Type: Autodesk.Revit.DB..::..XYZ The position to split in the straight.
# ### Return Value
Returns true if valid otherwise false if the straight cannot be split.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace